CHT/heated_plate/foam_only/fluid-openfoam/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    top
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    bottom
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    slip-bottom
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}
